app/views/home/_customer.html.erb

    <tbody>
        <% Restaurant.all.each do |res| %>
---
SELECT "restaurants".* FROM "restaurants"