app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "value", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "p4"], ["value", 20.0], ["restaurant_id", 3], ["created_at", "2021-03-31 18:27:13.906841"], ["updated_at", "2021-03-31 18:27:13.906841"]]