app/views/products/_form.html.erb

SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants"."name" ASC
---
        <%= form.label :restaurant %>
        <%= form.collection_select(:restaurant_id, Restaurant.order(:name), :id, :name, inclue_black: true) %>